1s/ERP/Conf/Enums/ТС_СрочностьРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТС_СрочностьРемонтныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Срочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтечениеСмены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Планово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапасныеФормыНаТираж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыполнению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТС_СрочностьРемонтныхРабот/Forms/ФормаВыбораИнфопад/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПодразделениеПолучатель") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Новый СписокЗначений;
		ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ГотовКВыполнению);
		Если Параметры.ПодразделениеПолучатель = Справочники.ТС_Подразделения.Формщики Тогда
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ВтечениеСмены);
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.Планово);
		Иначе
			ЭлементОтбора.ПравоеЗначение.Добавить(Перечисления.ТС_СрочностьРемонтныхРабот.ЗапасныеФормыНаТираж);
		КонецЕсли;
	КОнецЕсли;
		
	Если Параметры.Свойство("ТекущийЭлемент") И ЗначениеЗаполнено(Параметры.ТекущийЭлемент) Тогда
    	Элементы.Список.ТекущаяСтрока = Параметры.ТекущийЭлемент;
	КонецЕсли;
	
КонецПроцедуры
